{"config": [{"config": {"name": "conv2d_1", "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "batch_input_shape": [null, 36, 64, 1], "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 128}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 3}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}