{"keras_version": "2.0.6", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_1", "activity_regularizer": null, "batch_input_shape": [null, 36, 64, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "dtype": "float32", "data_format": "channels_last", "use_bias": true, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 128, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 3, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_4", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}