{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 36, 64, 1], "bias_constraint": null, "activation": "linear", "kernel_size": [3, 3], "filters": 32, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 128, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 3, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_4"}}]}