{"config": [{"config": {"kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "batch_input_shape": [null, 36, 64, 1], "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "bias_constraint": null, "activation": "linear", "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_constraint": null, "activation": "linear", "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_2", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 3, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}