{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "kernel_constraint": null, "batch_input_shape": [null, 36, 64, 1], "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "trainable": true, "activation": "linear", "dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "units": 128}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "units": 3}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "linear"}}], "keras_version": "2.0.6"}