{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d_1", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 36, 64, 1], "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "name": "conv2d_2", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 3, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "linear"}}], "keras_version": "2.0.6", "backend": "tensorflow"}