{"config": [{"config": {"activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "dtype": "float32", "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [3, 3], "kernel_constraint": null, "batch_input_shape": [null, 36, 64, 1], "activation": "linear", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}