{"backend": "tensorflow", "config": [{"config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "use_bias": true, "padding": "valid", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "conv2d_1", "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 36, 64, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "padding": "valid", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 3, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "linear", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6"}