{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_1", "kernel_size": [3, 3], "batch_input_shape": [null, 36, 64, 1], "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "filters": 32, "activation": "linear", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_2", "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "activation": "linear", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "units": 128, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "units": 3, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "linear"}}]}