{"class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_13", "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 36, 64, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_14", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "name": "conv2d_15", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "kernel_regularizer": null, "kernel_constraint": null, "units": 128, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_10", "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_25", "activation": "linear", "trainable": true}}]}