{"config": [{"config": {"kernel_regularizer": null, "dtype": "float32", "trainable": true, "activation": "linear", "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "batch_input_shape": [null, 36, 64, 1], "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_4", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "linear", "kernel_constraint": null, "filters": 64, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_5", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_5", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "linear", "kernel_constraint": null, "filters": 128, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_6", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_6", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "units": 128, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "units": 1, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_10"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}