{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "trainable": true, "name": "conv2d_16", "kernel_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "batch_input_shape": [null, 36, 64, 1], "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_16", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "name": "conv2d_17", "kernel_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_17", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1], "trainable": true, "name": "conv2d_18", "kernel_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_18", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "name": "dense_11", "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "name": "dense_12", "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_30", "trainable": true}}]}