{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 36, 64, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "padding": "valid", "filters": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "padding": "valid", "filters": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "padding": "valid", "filters": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 2, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "linear", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.0.4"}