{"keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "padding": "valid", "batch_input_shape": [null, 36, 64, 1], "use_bias": true, "strides": [1, 1], "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "strides": [1, 1], "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "strides": [1, 1], "filters": 128, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "units": 128, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "units": 2, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "linear", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}], "backend": "tensorflow", "class_name": "Sequential"}