{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "TimeDistributed", "config": {"dtype": "float32", "batch_input_shape": [null, 4, 36, 64, 1], "layer": {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid"}}, "trainable": true, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_1"}}, "trainable": true, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}, "trainable": true, "name": "time_distributed_3"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid"}}, "trainable": true, "name": "time_distributed_4"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_2"}}, "trainable": true, "name": "time_distributed_5"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}, "trainable": true, "name": "time_distributed_6"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, "trainable": true, "name": "time_distributed_7"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, "trainable": true, "name": "time_distributed_8"}}, {"class_name": "LSTM", "config": {"unroll": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "use_bias": true, "name": "lstm_1", "units": 128, "bias_constraint": null, "kernel_constraint": null, "return_state": false, "activation": "tanh", "activity_regularizer": null, "trainable": true, "return_sequences": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "go_backwards": false, "recurrent_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "units": 128, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null}}, "trainable": true, "name": "time_distributed_9"}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"activation": "linear", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2", "units": 2, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null}}, "trainable": true, "name": "time_distributed_10"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_4"}}]}
