{"keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_1", "kernel_regularizer": null, "trainable": true, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "kernel_size": [3, 3], "batch_input_shape": [null, 36, 64, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "activation": "linear", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "filters": 128, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "activation": "linear", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_5"}}]}