{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 36, 64, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "name": "conv2d_1", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 64, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "name": "conv2d_2", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 128, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "name": "conv2d_3", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_2", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_5"}}], "keras_version": "2.0.4", "backend": "tensorflow"}