{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 36, 64, 1], "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_regularizer": null, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "filters": 64, "bias_regularizer": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "units": 128, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "units": 3, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_4"}}]}