{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "batch_input_shape": [null, 36, 64, 1], "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_1", "activation": "linear", "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_2", "activation": "linear", "filters": 64, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 128, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 3, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_2", "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_4"}}], "keras_version": "2.0.6"}