{"config": [{"config": {"data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "dtype": "float32", "filters": 32, "strides": [1, 1], "batch_input_shape": [null, 36, 64, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 64, "strides": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 128, "strides": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow"}