{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "batch_input_shape": [null, 36, 64, 1], "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 32, "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 64, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "units": 1, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "linear"}}]}