{"class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "dtype": "float32", "activation": "linear", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 36, 64, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "units": 64, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "units": 1, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "linear"}}]}