{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "batch_input_shape": [null, 36, 64, 1], "bias_constraint": null, "filters": 128, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "linear", "trainable": true}}], "backend": "tensorflow"}