{"config": [{"config": {"batch_input_shape": [null, 36, 64, 1], "bias_constraint": null, "dtype": "float32", "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 32, "strides": [1, 1], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "name": "conv2d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "strides": [1, 1], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 64, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 1, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}