{"config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 36, 64, 1], "dtype": "float32", "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_1", "trainable": true, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_2", "trainable": true, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 32, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_3", "trainable": true, "use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "filters": 64, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "units": 64, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "units": 1, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow"}