{"keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 36, 64, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_1", "activation": "linear", "padding": "valid", "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_2", "activation": "linear", "padding": "valid", "filters": 64}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "activation": "linear", "padding": "valid", "filters": 128}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 128, "name": "dense_1", "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 1, "name": "dense_2", "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "linear", "trainable": true}}]}